michaelsedbon/SYNTHETICA_Lab/experiments/EXP_002/firmware/esp8266_ota/src/main.cpp
/*
 * Cryptographic Beings — ESP8266 Controller
 * ==========================================
 * Features:
 *   - WiFi connection + mDNS (cryptobeings.local)
 *   - OTA (Over-The-Air) firmware updates
 *   - Web dashboard on port 80 with live WebSocket logs
 *   - WebSocket debug server on port 81 (replaces Serial debug)
 *   - Serial bridge to Arduino Nano (hardware UART, 115200 baud)
 *   - OLED display (SSD1306 128x64, I2C on D1/D2)
 *   - REST API (/api/*) with JSON responses for agent control
 *
 * API endpoints:
 *   GET /api/ping         → {"ok":true,"response":"PONG"}
 *   GET /api/status       → {"pos":0,"hall":0,"enabled":1,...}
 *   GET /api/calibrate    → {"ok":true,"spr":30144}
 *   GET /api/half         → {"ok":true,"steps":15072}
 *   GET /api/home         → {"ok":true}
 *   GET /api/move?steps=N → {"ok":true,"steps":N}
 *   GET /api/move-to?pos=N → {"ok":true,"target":N}
 *   GET /api/stop         → {"ok":true}
 *   GET /api/speed?value=N → {"ok":true,"speed":N}
 *   GET /api/accel?value=N → {"ok":true,"accel":N}
 *
 * Debug strategy:
 *   Hardware Serial (TX/RX) is dedicated to the Nano link.
 *   All debug output goes through WebSocket on port 81.
 *   Open http://<ip> to see live-streaming logs.
 *
 * After first USB flash, future uploads go via OTA:
 *   pio run -e ota -t upload -d firmware/esp8266_ota
 */

#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <ESP8266WebServer.h>
#include <WebSocketsServer.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>

// ── Nano reset pin (ESP D5 = GPIO14 → Nano RST) ──
#define PIN_NANO_RESET 14

// ── WiFi credentials ──
const char* ssid     = "MEDICALEX";
const char* password = "94110Med+";

// ── OTA hostname ──
const char* hostname = "cryptobeings";

// ── OLED setup (128x64, I2C, address 0x3C) ──
#define SCREEN_WIDTH  128
#define SCREEN_HEIGHT 64
#define OLED_RESET    -1  // No reset pin
Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, OLED_RESET);
bool oledReady = false;

// ── Web server on port 80 ──
ESP8266WebServer server(80);

// ── WebSocket server on port 81 (debug pipe) ──
WebSocketsServer webSocket = WebSocketsServer(81);

// ── TCP serial bridge on port 2323 (raw bytes for flashing) ──
WiFiServer tcpBridge(2323);
WiFiClient tcpClient;

// ── Log buffer (ring buffer for web dashboard + WebSocket) ──
#define LOG_SIZE 50
String logBuffer[LOG_SIZE];
int logIndex = 0;

// ── Serial bridge buffer (reads from Nano) ──
String nanoBuffer = "";

// ── API response collection ──
// When an API call is in progress, we collect Nano responses here
#define API_RESPONSE_MAX 16
String apiResponseLines[API_RESPONSE_MAX];
int apiResponseCount = 0;
bool apiWaiting = false;
unsigned long apiStartTime = 0;
unsigned long apiTimeoutMs = 5000;  // Default 5s timeout


// ══════════════════════════════════════════════
// ── Debug logging (WiFi pipe) ──
// ══════════════════════════════════════════════

void debugLog(String msg) {
    // Store in ring buffer
    String entry = String(millis()) + "ms | " + msg;
    logBuffer[logIndex % LOG_SIZE] = entry;
    logIndex++;

    // Broadcast to all connected WebSocket clients
    webSocket.broadcastTXT(entry);
}

// ══════════════════════════════════════════════
// ── OLED display ──
// ══════════════════════════════════════════════

void oledShowBoot(String ip) {
    if (!oledReady) return;
    display.clearDisplay();

    // Title
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(4, 4);
    display.println(F("CRYPTOGRAPHIC"));
    display.setCursor(4, 16);
    display.println(F("   BEINGS"));

    // Divider line
    display.drawLine(0, 28, 128, 28, SSD1306_WHITE);

    // IP address
    display.setCursor(4, 34);
    display.print(F("IP: "));
    display.println(ip);

    // Status
    display.setCursor(4, 48);
    display.println(F("WiFi OK  |  API ON"));

    display.display();
}

// ══════════════════════════════════════════════
// ── API helper: send command and collect response ──
// ══════════════════════════════════════════════

void apiSendAndCollect(String cmd) {
    // Clear previous response
    apiResponseCount = 0;
    for (int i = 0; i < API_RESPONSE_MAX; i++) apiResponseLines[i] = "";

    // Send command to Nano
    Serial.println(cmd);
    debugLog("TX >> " + cmd);

    // Mark that we're waiting for response
    apiWaiting = true;
    apiStartTime = millis();
}

bool apiCollectLines(unsigned long timeout) {
    apiTimeoutMs = timeout;
    unsigned long start = millis();

    while (millis() - start < timeout) {
        // Read any available serial data
        while (Serial.available()) {
            char c = Serial.read();
            if (c == '\n') {
                if (nanoBuffer.length() > 0) {
                    debugLog("RX << " + nanoBuffer);
                    if (apiResponseCount < API_RESPONSE_MAX) {
                        apiResponseLines[apiResponseCount++] = nanoBuffer;
                    }
                    nanoBuffer = "";
                }
            } else if (c != '\r') {
                nanoBuffer += c;
            }
        }

        // Check if we have a complete response
        // Most commands respond with one line starting with OK, ERROR, PONG, HOMED, POS, etc.
        if (apiResponseCount > 0) {
            String lastLine = apiResponseLines[apiResponseCount - 1];
            // STATUS sends multiple lines, wait for all of them
            // We know STATUS ends with CAL: line now
            if (lastLine.startsWith("CAL:") || lastLine.startsWith("OK") ||
                lastLine.startsWith("ERROR") || lastLine.startsWith("PONG") ||
                lastLine.startsWith("HOMED") || lastLine.startsWith("CAL_DONE") ||
                lastLine.startsWith("CAL_FAIL") || lastLine.startsWith("CAL_ABORTED") ||
                lastLine.startsWith("SPR:")) {
                // For STATUS, we need to wait for the CAL: line which is the last field
                // For other commands, one response line is enough
                apiWaiting = false;
                return true;
            }
        }

        yield();  // Feed the ESP watchdog
        delay(10);
    }

    apiWaiting = false;
    return apiResponseCount > 0;
}

