michaelsedbon/SYNTHETICA_Lab/experiments/EXP_002/firmware/esp8266_ota/src/main.cpp
void sendCorsHeaders() {
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.sendHeader("Access-Control-Allow-Methods", "GET, OPTIONS");
    server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}


// ══════════════════════════════════════════════
// ── API endpoints ──
// ══════════════════════════════════════════════

void handleApiPing() {
    sendCorsHeaders();
    apiSendAndCollect("PING");
    if (apiCollectLines(3000)) {
        bool pong = false;
        for (int i = 0; i < apiResponseCount; i++) {
            if (apiResponseLines[i] == "PONG") pong = true;
        }
        if (pong) {
            server.send(200, "application/json", "{\"ok\":true,\"response\":\"PONG\"}");
        } else {
            server.send(200, "application/json", "{\"ok\":false,\"error\":\"unexpected_response\"}");
        }
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiStatus() {
    sendCorsHeaders();
    apiSendAndCollect("STATUS");
    // STATUS returns 7 lines: POS, HALL, ENABLED, SPEED, MOVING, SPR, CAL
    if (apiCollectLines(5000)) {
        long pos = 0;
        int hall = 0, enabled = 0, speed = 0, moving = 0, spr = 0, cal = 0;

        for (int i = 0; i < apiResponseCount; i++) {
            String line = apiResponseLines[i];
            if (line.startsWith("POS:")) pos = line.substring(4).toInt();
            else if (line.startsWith("HALL:")) hall = line.substring(5).toInt();
            else if (line.startsWith("ENABLED:")) enabled = line.substring(8).toInt();
            else if (line.startsWith("SPEED:")) speed = line.substring(6).toInt();
            else if (line.startsWith("MOVING:")) moving = line.substring(7).toInt();
            else if (line.startsWith("SPR:")) spr = line.substring(4).toInt();
            else if (line.startsWith("CAL:")) cal = line.substring(4).toInt();
        }

        String json = "{";
        json += "\"pos\":" + String(pos) + ",";
        json += "\"hall\":" + String(hall) + ",";
        json += "\"enabled\":" + String(enabled) + ",";
        json += "\"speed\":" + String(speed) + ",";
        json += "\"moving\":" + String(moving) + ",";
        json += "\"spr\":" + String(spr) + ",";
        json += "\"calibrated\":" + String(cal);
        json += "}";
        server.send(200, "application/json", json);
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiCalibrate() {
    sendCorsHeaders();
    apiSendAndCollect("CALIBRATE");
    // Calibration takes a long time — home + full revolution
    if (apiCollectLines(120000)) {  // 2 minute timeout
        bool done = false;
        long spr = 0;
        String errorMsg = "";

        for (int i = 0; i < apiResponseCount; i++) {
            String line = apiResponseLines[i];
            if (line.startsWith("CAL_DONE SPR:")) {
                done = true;
                spr = line.substring(13).toInt();
            } else if (line.startsWith("CAL_FAIL")) {
                errorMsg = line;
            }
        }

        if (done) {
            server.send(200, "application/json",
                "{\"ok\":true,\"spr\":" + String(spr) + "}");
        } else if (errorMsg.length() > 0) {
            server.send(200, "application/json",
                "{\"ok\":false,\"error\":\"" + errorMsg + "\"}");
        } else {
            server.send(200, "application/json",
                "{\"ok\":false,\"error\":\"calibration_incomplete\"}");
        }
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiHalf() {
    sendCorsHeaders();
    apiSendAndCollect("HALF");
    if (apiCollectLines(30000)) {  // 30s — half rotation may be slow
        for (int i = 0; i < apiResponseCount; i++) {
            String line = apiResponseLines[i];
            if (line.startsWith("OK HALF ")) {
                long steps = line.substring(8).toInt();
                server.send(200, "application/json",
                    "{\"ok\":true,\"steps\":" + String(steps) + "}");
                return;
            } else if (line.startsWith("ERROR:")) {
                server.send(200, "application/json",
                    "{\"ok\":false,\"error\":\"" + line + "\"}");
                return;
            }
        }
        server.send(200, "application/json", "{\"ok\":false,\"error\":\"unexpected_response\"}");
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiHome() {
    sendCorsHeaders();
    apiSendAndCollect("HOME");
    if (apiCollectLines(60000)) {  // 60s to home
        bool homed = false;
        for (int i = 0; i < apiResponseCount; i++) {
            if (apiResponseLines[i] == "HOMED") homed = true;
            if (apiResponseLines[i].startsWith("OK HOMING")) {
                // HOME responds with OK HOMING immediately, then HOMED later
                // We need to wait longer for the HOMED response
            }
        }
        // If we got OK HOMING but not yet HOMED, keep waiting
        if (!homed) {
            if (apiCollectLines(60000)) {
                for (int i = 0; i < apiResponseCount; i++) {
                    if (apiResponseLines[i] == "HOMED") homed = true;
                }
            }
        }
        if (homed) {
            server.send(200, "application/json", "{\"ok\":true}");
        } else {
            server.send(200, "application/json", "{\"ok\":false,\"error\":\"homing_incomplete\"}");
        }
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiMove() {
    sendCorsHeaders();
    if (!server.hasArg("steps")) {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"missing_steps_param\"}");
        return;
    }
    long steps = server.arg("steps").toInt();
    apiSendAndCollect("MOVE " + String(steps));
    if (apiCollectLines(5000)) {
        for (int i = 0; i < apiResponseCount; i++) {
            if (apiResponseLines[i].startsWith("OK MOVE")) {
                server.send(200, "application/json",
                    "{\"ok\":true,\"steps\":" + String(steps) + "}");
                return;
            } else if (apiResponseLines[i].startsWith("ERROR:")) {
                server.send(200, "application/json",
                    "{\"ok\":false,\"error\":\"" + apiResponseLines[i] + "\"}");
                return;
            }
        }
        server.send(200, "application/json", "{\"ok\":false,\"error\":\"unexpected_response\"}");
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiMoveTo() {
    sendCorsHeaders();
    if (!server.hasArg("pos")) {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"missing_pos_param\"}");
        return;
    }
    long pos = server.arg("pos").toInt();
    apiSendAndCollect("MOVETO " + String(pos));
    if (apiCollectLines(5000)) {
        for (int i = 0; i < apiResponseCount; i++) {
            if (apiResponseLines[i].startsWith("OK MOVETO")) {
                server.send(200, "application/json",
                    "{\"ok\":true,\"target\":" + String(pos) + "}");
                return;
            }
        }
        server.send(200, "application/json", "{\"ok\":false,\"error\":\"unexpected_response\"}");
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiStop() {
    sendCorsHeaders();
    apiSendAndCollect("STOP");
    if (apiCollectLines(3000)) {
        server.send(200, "application/json", "{\"ok\":true}");
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

