michaelsedbon/SYNTHETICA_Lab/experiments/EXP_002/firmware/esp8266_ota/src/main.cpp
void handleApiSpeed() {
    sendCorsHeaders();
    if (!server.hasArg("value")) {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"missing_value_param\"}");
        return;
    }
    int value = server.arg("value").toInt();
    apiSendAndCollect("SPEED " + String(value));
    if (apiCollectLines(3000)) {
        for (int i = 0; i < apiResponseCount; i++) {
            if (apiResponseLines[i].startsWith("OK SPEED")) {
                server.send(200, "application/json",
                    "{\"ok\":true,\"speed\":" + String(value) + "}");
                return;
            } else if (apiResponseLines[i].startsWith("ERROR:")) {
                server.send(200, "application/json",
                    "{\"ok\":false,\"error\":\"" + apiResponseLines[i] + "\"}");
                return;
            }
        }
        server.send(200, "application/json", "{\"ok\":false,\"error\":\"unexpected_response\"}");
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

void handleApiAccel() {
    sendCorsHeaders();
    if (!server.hasArg("value")) {
        server.send(400, "application/json", "{\"ok\":false,\"error\":\"missing_value_param\"}");
        return;
    }
    int value = server.arg("value").toInt();
    apiSendAndCollect("ACCEL " + String(value));
    if (apiCollectLines(3000)) {
        for (int i = 0; i < apiResponseCount; i++) {
            if (apiResponseLines[i].startsWith("OK ACCEL")) {
                server.send(200, "application/json",
                    "{\"ok\":true,\"accel\":" + String(value) + "}");
                return;
            } else if (apiResponseLines[i].startsWith("ERROR:")) {
                server.send(200, "application/json",
                    "{\"ok\":false,\"error\":\"" + apiResponseLines[i] + "\"}");
                return;
            }
        }
        server.send(200, "application/json", "{\"ok\":false,\"error\":\"unexpected_response\"}");
    } else {
        server.send(504, "application/json", "{\"ok\":false,\"error\":\"timeout\"}");
    }
}

// ══════════════════════════════════════════════
// ── WebSocket event handler ──
// ══════════════════════════════════════════════

void webSocketEvent(uint8_t num, WStype_t type, uint8_t * payload, size_t length) {
    switch (type) {
        case WStype_DISCONNECTED:
            break;
        case WStype_CONNECTED:
            {
                // Send recent log history to newly connected client
                int start = max(0, logIndex - LOG_SIZE);
                for (int i = start; i < logIndex; i++) {
                    webSocket.sendTXT(num, logBuffer[i % LOG_SIZE]);
                }
            }
            break;
        case WStype_TEXT:
            {
                // Client can also send commands to Nano via WebSocket
                String cmd = String((char*)payload);
                cmd.trim();
                if (cmd.length() > 0) {
                    Serial.println(cmd);  // Forward to Nano
                    debugLog("TX >> " + cmd);
                }
            }
            break;
        default:
            break;
    }
}

// ══════════════════════════════════════════════
// ── Legacy web handlers (kept for backward compatibility) ──
// ══════════════════════════════════════════════

void handleRoot() {
    String html = "<!DOCTYPE html><html><head>";
    html += "<meta name='viewport' content='width=device-width,initial-scale=1'>";
    html += "<title>Cryptographic Beings</title>";
    html += "<style>";
    html += "body{font-family:monospace;background:#111;color:#0f0;padding:20px;margin:0}";
    html += "h1{color:#0ff;border-bottom:1px solid #333;padding-bottom:10px;margin-top:0}";
    html += ".log{background:#1a1a1a;padding:10px;border:1px solid #333;";
    html += "max-height:400px;overflow-y:auto;font-size:12px;line-height:1.6}";
    html += ".log div{padding:2px 0;border-bottom:1px solid #1f1f1f}";
    html += ".info{color:#888;margin:10px 0;font-size:12px}";
    html += "input{background:#222;color:#0f0;border:1px solid #444;padding:8px;";
    html += "font-family:monospace;width:60%}";
    html += "button{background:#0a0;color:#000;border:none;padding:8px 16px;";
    html += "cursor:pointer;font-family:monospace;font-weight:bold}";
    html += "button:hover{background:#0f0}";
    html += ".status{color:#0ff;font-size:14px;margin-bottom:16px}";
    html += ".ws-status{color:#f80;font-size:12px;margin:6px 0}";
    html += "</style></head><body>";
    html += "<h1>CRYPTOGRAPHIC BEINGS</h1>";
    html += "<div class='status'>WiFi: " + WiFi.localIP().toString() + " | ";
    html += "Uptime: " + String(millis() / 1000) + "s | ";
    html += "Free RAM: " + String(ESP.getFreeHeap()) + " bytes</div>";
    html += "<div class='ws-status' id='wsStatus'>WebSocket: connecting...</div>";

    // Command form
    html += "<h2>Send to Nano</h2>";
    html += "<form id='cmdForm' onsubmit='sendCmd(event)'>";
    html += "<input id='cmd' placeholder='e.g. MOVE 200, HOME, STATUS, PING, HALF, CALIBRATE'>";
    html += " <button type='submit'>SEND</button></form>";

    // Log output
    html += "<h2>Live Debug Log</h2><div class='log' id='logDiv'></div>";

    // API quick links
    html += "<h2>API Endpoints</h2>";
    html += "<div class='info'>";
    html += "<a href='/api/ping' style='color:#0f0'>GET /api/ping</a> | ";
    html += "<a href='/api/status' style='color:#0f0'>GET /api/status</a> | ";
    html += "<a href='/api/half' style='color:#0f0'>GET /api/half</a> | ";
    html += "<a href='/api/home' style='color:#0f0'>GET /api/home</a> | ";
    html += "<a href='/api/calibrate' style='color:#0f0'>GET /api/calibrate</a>";
    html += "</div>";

    // JavaScript: WebSocket client
    html += "<script>";
    html += "var ws;var logDiv=document.getElementById('logDiv');";
    html += "function connect(){";
    html += "ws=new WebSocket('ws://'+location.hostname+':81/');";
    html += "ws.onopen=function(){document.getElementById('wsStatus').innerHTML='WebSocket: <span style=color:#0f0>connected</span>';};";
    html += "ws.onmessage=function(e){";
    html += "var d=document.createElement('div');d.textContent=e.data;";
    html += "logDiv.insertBefore(d,logDiv.firstChild);";
    html += "if(logDiv.children.length>100)logDiv.removeChild(logDiv.lastChild);};";
    html += "ws.onclose=function(){document.getElementById('wsStatus').innerHTML='WebSocket: <span style=color:red>disconnected</span> (reconnecting...)';setTimeout(connect,2000);};";
    html += "ws.onerror=function(){ws.close();};";
    html += "}connect();";
    html += "function sendCmd(e){e.preventDefault();var c=document.getElementById('cmd').value;if(c&&ws&&ws.readyState===1){ws.send(c);document.getElementById('cmd').value='';}}";
    html += "</script>";

