michaelsedbon/SYNTHETICA_Lab/experiments/EXP_002/firmware/esp8266_ota/src/main.cpp
    html += "<div class='info'>OTA enabled: " + String(hostname) + ".local:8266 | WS debug: port 81</div>";
    html += "</body></html>";

    server.send(200, "text/html", html);
}

void handleSend() {
    if (server.hasArg("cmd")) {
        String cmd = server.arg("cmd");
        Serial.println(cmd);  // Send to Nano via hardware TX
        debugLog("TX >> " + cmd);
    }
    server.sendHeader("Location", "/");
    server.send(302);
}

void handleStatus() {
    String json = "{";
    json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
    json += "\"uptime\":" + String(millis() / 1000) + ",";
    json += "\"heap\":" + String(ESP.getFreeHeap()) + ",";
    json += "\"rssi\":" + String(WiFi.RSSI()) + ",";
    json += "\"oled\":" + String(oledReady ? "true" : "false");
    json += "}";
    server.send(200, "application/json", json);
}

void handleLog() {
    String json = "[";
    int start = max(0, logIndex - LOG_SIZE);
    for (int i = start; i < logIndex; i++) {
        if (i > start) json += ",";
        json += "\"" + logBuffer[i % LOG_SIZE] + "\"";
    }
    json += "]";
    server.send(200, "application/json", json);
}

void handleResetNano() {
    debugLog("Resetting Nano via D5...");
    // Pull RESET low for 100ms, then release
    digitalWrite(PIN_NANO_RESET, LOW);
    delay(100);
    digitalWrite(PIN_NANO_RESET, HIGH);
    debugLog("Nano reset complete — bootloader window open");
    server.sendHeader("Access-Control-Allow-Origin", "*");
    server.send(200, "application/json", "{\"ok\":true,\"msg\":\"Nano reset, bootloader active\"}");
}

// ══════════════════════════════════════════════
// ── Setup ──
// ══════════════════════════════════════════════

void setup() {
    // Hardware Serial → dedicated to Nano communication
    Serial.begin(115200);

    // Nano reset pin — start HIGH (not resetting)
    pinMode(PIN_NANO_RESET, OUTPUT);
    digitalWrite(PIN_NANO_RESET, HIGH);

    // ── OLED init ──
    Wire.begin();  // D1=SCL, D2=SDA (ESP8266 defaults)
    if (display.begin(SSD1306_SWITCHCAPVCC, 0x3C)) {
        oledReady = true;
        display.clearDisplay();
        display.setTextSize(1);
        display.setTextColor(SSD1306_WHITE);
        display.setCursor(4, 24);
        display.println(F("Booting..."));
        display.display();
    }

    // ── WiFi ──
    WiFi.mode(WIFI_STA);
    WiFi.hostname(hostname);
    WiFi.begin(ssid, password);

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 30) {
        delay(500);
        attempts++;
    }

    String ip = "NO WIFI";
    if (WiFi.status() == WL_CONNECTED) {
        ip = WiFi.localIP().toString();
        debugLog("WiFi connected: " + ip);
    } else {
        debugLog("WiFi connection FAILED");
    }

    // ── mDNS ──
    if (MDNS.begin(hostname)) {
        debugLog("mDNS: " + String(hostname) + ".local");
    }

    // ── OTA ──
    ArduinoOTA.setHostname(hostname);
    ArduinoOTA.setPort(8266);

    ArduinoOTA.onStart([]() {
        debugLog("OTA update starting...");
        if (oledReady) {
            display.clearDisplay();
            display.setCursor(4, 24);
            display.println(F("OTA updating..."));
            display.display();
        }
    });
    ArduinoOTA.onEnd([]() {
        debugLog("OTA update complete!");
    });
    ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
        // Progress updates — only to OLED to avoid WebSocket spam
        if (oledReady) {
            int pct = progress / (total / 100);
            display.clearDisplay();
            display.setCursor(4, 16);
            display.println(F("OTA updating..."));
            display.setCursor(4, 32);
            display.print(pct);
            display.println(F("%"));
            // Progress bar
            display.drawRect(4, 48, 120, 10, SSD1306_WHITE);
            display.fillRect(4, 48, (120 * pct) / 100, 10, SSD1306_WHITE);
            display.display();
        }
    });
    ArduinoOTA.onError([](ota_error_t error) {
        String errMsg = "OTA Error: ";
        if (error == OTA_AUTH_ERROR) errMsg += "Auth Failed";
        else if (error == OTA_BEGIN_ERROR) errMsg += "Begin Failed";
        else if (error == OTA_CONNECT_ERROR) errMsg += "Connect Failed";
        else if (error == OTA_RECEIVE_ERROR) errMsg += "Receive Failed";
        else if (error == OTA_END_ERROR) errMsg += "End Failed";
        debugLog(errMsg);
    });
    ArduinoOTA.begin();
    debugLog("OTA ready on port 8266");

    // ── WebSocket server (debug pipe) ──
    webSocket.begin();
    webSocket.onEvent(webSocketEvent);
    debugLog("WebSocket debug server on port 81");

    // ── HTTP server ──
    // Legacy endpoints
    server.on("/", handleRoot);
    server.on("/send", handleSend);
    server.on("/status", handleStatus);
    server.on("/log", handleLog);
    server.on("/reset-nano", handleResetNano);

    // New REST API endpoints
    server.on("/api/ping", handleApiPing);
    server.on("/api/status", handleApiStatus);
    server.on("/api/calibrate", handleApiCalibrate);
    server.on("/api/half", handleApiHalf);
    server.on("/api/home", handleApiHome);
    server.on("/api/move", handleApiMove);
    server.on("/api/move-to", handleApiMoveTo);
    server.on("/api/stop", handleApiStop);
    server.on("/api/speed", handleApiSpeed);
    server.on("/api/accel", handleApiAccel);

    server.begin();
    debugLog("Web server started on port 80 (legacy + API)");

    // ── TCP serial bridge (for Nano flashing) ──
    tcpBridge.begin();
    debugLog("TCP serial bridge on port 2323");

    // ── Show boot screen on OLED ──
    oledShowBoot(ip);

    debugLog("=== SYSTEM READY ===");
}

// ══════════════════════════════════════════════
// ── Loop ──
// ══════════════════════════════════════════════

void loop() {
    ArduinoOTA.handle();
    server.handleClient();
    MDNS.update();
    webSocket.loop();

    // ── TCP serial bridge: raw byte forwarding ──
    if (tcpBridge.hasClient()) {
        if (tcpClient && tcpClient.connected()) {
            tcpClient.stop();  // Only one client at a time
        }
        tcpClient = tcpBridge.accept();
        debugLog("TCP bridge client connected");
    }

    if (tcpClient && tcpClient.connected()) {
        // TCP → Serial (raw bytes from flasher to Nano)
        while (tcpClient.available()) {
            Serial.write(tcpClient.read());
        }
        // Serial → TCP (raw bytes from Nano to flasher)
        while (Serial.available()) {
            tcpClient.write(Serial.read());
        }
    } else if (!apiWaiting) {
        // Normal mode: read Nano responses line-by-line for logging
        // (Skip when API is waiting — it handles its own serial reads)
        while (Serial.available()) {
            char c = Serial.read();
            if (c == '\n') {
                debugLog("RX << " + nanoBuffer);
                nanoBuffer = "";
            } else if (c != '\r') {
                nanoBuffer += c;
            }
        }
    }
}
